Use mermaid format instead of dot to render CFG in tests
